package array

import "fmt"

func State() {
	//申明数组 var name [length] type

	// 1.申明一个包含5个元素的整形数组
	var a1 [5]int

	// 2.申明一个包含5个元素的整形数组
	// 2.1用具体值初始化每个元素
	var a2 [5]int = [5]int{10, 20, 30, 40, 50}

	// 3.申明一个整形数组
	// 3.1使用具体值初始胡化每个元素
	// 3.2容量初始化值由元素数量决定
	a3 := [...]int{10, 20, 30, 40, 50}

	// 4.申明一个由5个元素的数组
	// 4.1使用具体值初始化1和2位置上的元素
	// 4.2其余位置为类型默认值
	// 4.3结果0,10,20,0,0
	a4 := [5]int{1: 10, 2: 20}

	fmt.Println(a1, a2, a3, a4)
}

func UseArray() {
	// 1.申明长度为5的数组
	// 1.1使用具体值为数组赋值
	a1 := [5]int{10, 20, 30, 40, 50}
	// 1.2修改位置为2的数组元素的值
	a1[2] = 35

	v := 2
	// 2.申明包含5个元素的数组，里面的元素指向整数
	// 2.1初始化数组中每个元素的指针的指向
	a2 := [5]*int{0: new(int), 1: new(int), 2: &v}
	// 2.2为索引0，1处位置的元素赋值
	*a2[0] = 10
	*a2[1] = 20

	var xx *[]int
	fmt.Printf("%T，%T", xx, a2)

}
